app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)

  def create
    @comment = Comment.new(params[:comment])

    if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id", "episode_id") VALUES('Testing', '2010-03-23 03:06:39', '2010-03-23 03:06:39', NULL, NULL)