app/controllers/episodes_controller.rb

  def add
    @comment = Comment.new(params[:comment])
    @current_user.comments<<@comment
---
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id", "episode_id") VALUES('Test', '2010-03-23 04:51:45', '2010-03-23 04:51:45', 2, NULL)

  def watched
    @watched = Watched.new
    @episode = Episode.find(params[:id])
    @watched.save
---
SELECT * FROM "episodes" WHERE ("episodes"."id" = 1)
INSERT INTO "watcheds" ("created_at", "updated_at", "rank", "user_id", "watched", "episode_id") VALUES('2010-03-23 05:25:21', '2010-03-23 05:25:21', NULL, NULL, NULL, NULL)

  def index
    @episodes = Episode.all
---
SELECT * FROM "episodes"

  def show
    @episode = Episode.find(params[:id])
---
SELECT * FROM "episodes" WHERE ("episodes"."id" = 1)

  def edit
    @episode = Episode.find(params[:id])
---
SELECT * FROM "episodes" WHERE ("episodes"."id" = 1)

  def update
    @episode = Episode.find(params[:id])

    if @episode.update_attributes(params[:episode])
---
SELECT * FROM "episodes" WHERE ("episodes"."id" = 1)
UPDATE "episodes" SET "updated_at" = '2010-03-23 05:48:19', "title" = 'No More Good Days', "air_date" = '2009-09-24', "description" = 'On what seems to be a day like any other, everyone on Earth blacks out at the same moment for 2 minutes and 17 seconds. They also have a vision of where they will be or what they are doing some six months into the future, on April 29, 2010. For FBI Agent Mark Benford, the vision is disturbing: he sees himself working on this case, drinking again and with someone at the FBI building out to kill him. Mark''s wife, a surgeon, sees herself in a relationship with another man, apparently someone she doesn''t know yet. Mark''s partner, Agent Demetri Noh has no vision at all and believes that can only mean one thing. As they begin to investigate the phenomena, the FBI come across startling videotape showing that at least one person didn''t black out.', "link" = 'http://www.imdb.com/title/tt1444864/' WHERE "id" = 1

  def destroy
    @episode = Episode.find(params[:id])
    @episode.destroy
---
SELECT * FROM "episodes" WHERE ("episodes"."id" = 1)
DELETE FROM "episodes" WHERE "id" = 1