app/controllers/seasons_controller.rb

SELECT * FROM "seasons" WHERE ("seasons"."id" = 6)
SELECT count(*) AS count_all FROM "episodes" WHERE ("episodes".season_id = 6)
INSERT INTO "episodes" ("number", "created_at", "title", "air_date", "updated_at", "watched_id", "season_id", "link", "description", "comment_id") VALUES(NULL, '2010-03-23 02:06:28', NULL, NULL, '2010-03-23 02:06:28', NULL, 1, NULL, NULL, NULL)
---
  def addepisode
    @season = Season.find(params[:id])
    length = @season.episodes.size + 1
    @episode = @season.episodes.create(:season => @season)

SELECT * FROM "seasons" LIMIT 1
---
  def index
    @seasons = Season.all

SELECT * FROM "seasons" WHERE ("seasons"."id" = 2)
---
  def show
    @season = Season.find(params[:id])

SELECT * FROM "seasons" WHERE ("seasons"."id" = 2)
---
  def edit
    @season = Season.find(params[:id])

INSERT INTO "seasons" ("number", "created_at", "updated_at", "link", "episode_id", "show_id") VALUES(1, '2010-03-23 00:28:13', '2010-03-23 00:28:13', 'http://www.imdb.com/title/tt1441135/episodes#season-1', NULL, NULL)
---
  def create
    @season = Season.new(params[:season])

    if @season.save

SELECT * FROM "seasons" WHERE ("seasons"."id" = 2)
UPDATE "seasons" SET "updated_at" = '2010-03-22 23:38:47', "link" = 'http://www.imdb.com/title/tt0804503/episodes#season-1' WHERE "id" = 2
---
  def update
    @season = Season.find(params[:id])

    if @season.update_attributes(params[:season])

SELECT * FROM "seasons" WHERE ("seasons"."id" = 1)
DELETE FROM "seasons" WHERE "id" = 1
---
  def destroy
    @season = Season.find(params[:id])
    @season.destroy