app/controllers/shows_controller.rb

  def add
    @show = Show.find(params[:id])
    @current_user.shows<<@show
    @current_user.save
---
SELECT * FROM "shows" WHERE ("shows".user_id = 3)
INSERT INTO "shows" ("created_at", "title", "updated_at", "season_id", "user_id", "link", "description") VALUES('2010-03-21 22:55:05', NULL, '2010-03-21 22:55:05', NULL, 1, NULL, NULL)
UPDATE "shows" SET "updated_at" = '2010-03-22 04:13:43', "user_id" = 1 WHERE "id" = 7
UPDATE "users" SET "show_id" = 1, "updated_at" = '2010-03-23 06:20:27' WHERE "id" = 1

  def addseason
    @show = Show.find(params[:id])
    length = @show.seasons.size + 1
    @season = @show.seasons.create(:number => length, :show => @show)
---
SELECT * FROM "shows" WHERE ("shows"."id" = 17)
SELECT * FROM "seasons" WHERE ("seasons".show_id = 17)
SELECT count(*) AS count_all FROM "seasons" WHERE ("seasons".show_id = 17)
INSERT INTO "seasons" ("number", "created_at", "updated_at", "link", "episode_id", "show_id") VALUES(1, '2010-03-22 23:02:48', '2010-03-22 23:02:48', NULL, NULL, 17)

  def index
    @shows = Show.all
---
SELECT * FROM "shows"

  def show
    @show = Show.find(params[:id])
---
SELECT * FROM "shows" WHERE ("shows"."id" = 1)

  def edit
    @show = Show.find(params[:id])
---
SELECT * FROM "shows" WHERE ("shows"."id" = 1)

  def create
    @show = Show.new(params[:show])

    if @show.save
---
INSERT INTO "shows" ("created_at", "title", "updated_at", "season_id", "user_id", "link", "description") VALUES('2010-03-21 18:48:13', 'Lost', '2010-03-21 18:48:13', NULL, NULL, 'another', 'testest')

  def update
    @show = Show.find(params[:id])

    if @show.update_attributes(params[:show])
---
SELECT * FROM "shows" WHERE ("shows"."id" = 1)
UPDATE "shows" SET "updated_at" = '2010-03-22 23:36:08', "description" = 'Federal Agent Jack Bauer can''t afford to always play by the rules. As a member of the L.A. Counter Terrorist Unit, Jack must stop bombs, viruses, assassination attempts, and usually save someone he cares about at the same time. Every season of this series has 24 episodes, each unfolding in real time following a consecutive hour in one very bad day. ', "link" = 'http://www.imdb.com/title/tt0285331/' WHERE "id" = 1

  def destroy
    @show = Show.find(params[:id])
    @show.destroy
---
SELECT * FROM "shows" WHERE ("shows"."id" = 3)
DELETE FROM "shows" WHERE "id" = 3