app/controllers/users_controller.rb

SELECT * FROM "shows"
---
  def addshow
    @shows = Show.all

INSERT INTO "users" ("name", "created_at", "updated_at", "watched_id", "administrator", "login", "password", "show_id", "comment_id", "email") VALUES('Bran', '2010-03-23 00:39:46', '2010-03-23 00:39:46', NULL, NULL, 'bran', 'test', NULL, NULL, 'bransorem@gmail.com')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-03-23 01:50:05', "email" = 'test', "name" = 'Bran', "login" = 'bran', "password" = 'test' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])