app/controllers/watcheds_controller.rb

  def index
    @watcheds = Watched.all
---
SELECT * FROM "watcheds"

  def show
    @watched = Watched.find(params[:id])
---
SELECT * FROM "watcheds" WHERE ("watcheds"."id" = 5)